{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\graphs_variance.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Nov 2019, 16:52:38
{txt}
{com}. 
. u data3,clear
{txt}
{com}. 
. ******Does not use osbervations with topcoded income or financial income or federal taxes paid******
. replace asset=. if trunca==1
{txt}(25 real changes made, 25 to missing)

{com}. replace y    =. if truncy==1
{txt}(9 real changes made, 9 to missing)

{com}. replace ftax =. if ftax==99999 & year>=1982 & year<=1985
{txt}(10 real changes made, 10 to missing)

{com}. 
.                                                         /*Y=LY+TR+FI (LY=lab inc, TR=Transfers, FI=Financ inc) */
. gen ratio_ya=(y-asset)/y                        /*Ratio of non-financial income to income, i.e. (LY+TR)/Y */
{txt}(34 missing values generated)

{com}. replace ratio_ya=0 if ratio_ya<0
{txt}(0 real changes made)

{com}. 
. keep if seo==0
{txt}(12,455 observations deleted)

{com}. drop if age<30|age>65
{txt}(3,586 observations deleted)

{com}. 
. gen nas_scale=sqrt(ncomp)
{txt}
{com}. replace lc=lc-ln(nas_scale)
{txt}(14,984 real changes made)

{com}.                                                         /*Two definitions of after-tax income*/
.                                                         /*Def #1: Total income - Taxes on total income */
.                                                         /*Def #2: Non-financial income - Taxes on non-financial income */
. gen     ly_alt=ln(y-ftax)-ln(nas_scale)                         
{txt}(35 missing values generated)

{com}. replace ly    =ln(y-asset-ratio_ya*ftax)-ln(nas_scale)
{txt}(17,604 real changes made, 56 to missing)

{com}. 
. gen lf=ln(food+fout)-ln(nas_scale)
{txt}(2,620 missing values generated)

{com}. collapse (mean) m_psd=lc m_yp=ly f_p=lf (sd) v_psd=lc v_yp=ly v_yp_alt=ly_alt v_fp=lf,by(year)
{txt}
{com}. 
. replace v_yp=v_yp^2
{txt}(15 real changes made)

{com}. replace v_yp_alt=v_yp_alt^2
{txt}(15 real changes made)

{com}. replace v_f=v_f^2
{txt}(13 real changes made)

{com}. replace v_f=. if v_f==0
{txt}(0 real changes made)

{com}. replace m_psd=. if m_psd==0
{txt}(0 real changes made)

{com}. replace v_psd=. if v_psd==0
{txt}(0 real changes made)

{com}. 
. replace v_psd=v_psd^2
{txt}(13 real changes made)

{com}. 
. sort year
{txt}
{com}. 
. keep m_* v_* year f_p
{txt}
{com}. sort year
{txt}
{com}. save mean_psid,replace
{txt}(note: file mean_psid.dta not found)
file mean_psid.dta saved

{com}. 
. u cexall,clear
{txt}
{com}. 
. gen     coh=1  if yb>=1950 & yb<=1959
{txt}(11,848 missing values generated)

{com}. replace coh=2  if yb>=1940 & yb<=1949
{txt}(5,235 real changes made)

{com}. replace coh=3  if yb>=1930 & yb<=1939
{txt}(3,738 real changes made)

{com}. replace coh=4  if yb>=1920 & yb<=1929
{txt}(2,875 real changes made)

{com}. tab coh,gen(cohd)

        {txt}coh {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,664       23.62       23.62
{txt}          2 {c |}{res}      5,235       33.75       57.37
{txt}          3 {c |}{res}      3,738       24.10       81.47
{txt}          4 {c |}{res}      2,875       18.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     15,512      100.00
{txt}
{com}. drop if coh==.
{txt}(0 observations deleted)

{com}. drop if age <30|age >65
{txt}(0 observations deleted)

{com}. 
. gen nas_scale=sqrt(ncomp)
{txt}
{com}. gen lx=ln(ndur)-ln(nas_scale)
{txt}
{com}. gen ly  =ln(income)                             /*This is not used*/
{txt}
{com}. 
. gen lf=ln(food+fout)-ln(nas_scale)
{txt}
{com}. collapse (mean) m_cex=lx m_yc=ly f_c=lf (sd) v_cex=lx v_yc=ly v_fc=lf,by(year)
{txt}
{com}. 
. replace v_yc=v_yc^2
{txt}(13 real changes made)

{com}. replace v_fc=v_fc^2
{txt}(13 real changes made)

{com}. replace m_cex=. if m_cex==0
{txt}(0 real changes made)

{com}. replace v_cex=. if v_cex==0
{txt}(0 real changes made)

{com}. 
. replace v_cex=v_cex^2
{txt}(13 real changes made)

{com}. 
. keep m_* v_* f_c year
{txt}
{com}. sort year
{txt}
{com}. save mean_cex,replace
{txt}(note: file mean_cex.dta not found)
file mean_cex.dta saved

{com}. 
. u mean_cex,clear
{txt}
{com}. merge year using mean_psid
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          2 {c |}{res}          2       13.33       13.33
{txt}          3 {c |}{res}         13       86.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         15      100.00
{txt}
{com}. drop _merge
{txt}
{com}. save mean,replace
{txt}file mean.dta saved

{com}. 
. erase mean_cex.dta
{txt}
{com}. erase mean_psid.dta
{txt}
{com}. 
. sort year
{txt}
{com}. keep if year>=1980 & year<=1992
{txt}(2 observations deleted)

{com}. 
. gen m_psd1=m_psd if year<=1986
{txt}(6 missing values generated)

{com}. gen m_psd2=m_psd if year>=1989
{txt}(9 missing values generated)

{com}. gen f_p1=f_p if year<=1986
{txt}(6 missing values generated)

{com}. gen f_p2=f_p if year>=1989
{txt}(9 missing values generated)

{com}. lab var m_psd1 "Mean of log(C) PSID, 80-86"
{txt}
{com}. lab var m_psd2 "Mean of log(C) PSID, 89-92"
{txt}
{com}. lab var f_p1 "Mean of log(f) PSID, 80-86"
{txt}
{com}. lab var f_p2 "Mean of log(f) PSID, 89-92"
{txt}
{com}. lab var m_cex "Mean of log(C) CEX"
{txt}
{com}. lab var f_c "Mean of log(f) CEX"
{txt}
{com}. #delimit;
{txt}delimiter now ;
{com}. gr7 m_psd1 m_psd2 m_cex year,c(lll[-]) sy(opi) xlabel(1980 1982 to 1992) ylabel(8.6 8.8 to 9.4) l1("log(C)") 
>                                 saving(C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\mean_wrong,replace) title(Panel A);
{txt}
{com}. gr7 f_p1 f_p2 f_c year,c(lll[-]) sy(opi) xlabel(1980 1982 to 1992) ylabel(7.5 7.7 to 8.3) l1("log(food)") 
>                                 saving(C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\food,replace) title(Panel B);
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. merge using b0
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. drop _merge
{txt}
{com}. tab year,gen(yrd)

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1980 {c |}{res}          1        7.69        7.69
{txt}       1981 {c |}{res}          1        7.69       15.38
{txt}       1982 {c |}{res}          1        7.69       23.08
{txt}       1983 {c |}{res}          1        7.69       30.77
{txt}       1984 {c |}{res}          1        7.69       38.46
{txt}       1985 {c |}{res}          1        7.69       46.15
{txt}       1986 {c |}{res}          1        7.69       53.85
{txt}       1987 {c |}{res}          1        7.69       61.54
{txt}       1988 {c |}{res}          1        7.69       69.23
{txt}       1989 {c |}{res}          1        7.69       76.92
{txt}       1990 {c |}{res}          1        7.69       84.62
{txt}       1991 {c |}{res}          1        7.69       92.31
{txt}       1992 {c |}{res}          1        7.69      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         13      100.00
{txt}
{com}. #delimit;
{txt}delimiter now ;
{com}. gen gamma=b0_lx[1]+b0_lxy1[1]*yrd1+b0_lxy2[1]*yrd2+b0_lxy3[1]*yrd3+b0_lxy4[1]*yrd4+b0_lxy5[1]*yrd5+b0_lxy6[1]*yrd6+b0_lxy7[1]*yrd7
> +b0_lxy8[1]*yrd8+b0_lxy9[1]*yrd9+b0_lxy10[1]*yrd10+b0_lxy11[1]*yrd11+b0_lxy12[1]*yrd12;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. drop b0* yrd*
{txt}
{com}. 
. gen diff_f=(1/gamma)*(f_p-f_c)
{txt}(2 missing values generated)

{com}. gen diff_c=m_psd-m_cex
{txt}(2 missing values generated)

{com}. lab var diff_c "log(C,PSID)-log(C,CEX)"
{txt}
{com}. lab var diff_f "(log(f,PSID)-log(f,CEX))/beta"
{txt}
{com}. gen m_psd_c=m_psd-diff_f
{txt}(2 missing values generated)

{com}. 
. gen m_psd_c1=m_psd_c if year<=1986
{txt}(6 missing values generated)

{com}. gen m_psd_c2=m_psd_c if year>=1989
{txt}(9 missing values generated)

{com}. lab var m_psd_c1 "Mean of log(C) PSID 80-86, corr."
{txt}
{com}. lab var m_psd_c2 "Mean of log(C) PSID 89-92, corr."
{txt}
{com}. 
. #delimit;
{txt}delimiter now ;
{com}. gr7 diff_f diff_c year,c(ll) sy(oi) xlabel(1980 1982 to 1992) ylabel(-.05 0 to .15) l1(" ") 
>                                 saving(C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\diff,replace) title(Panel C);
{txt}
{com}. gr7 m_psd_c1 m_psd_c2 m_cex year,       c(lll[-]) s(opi) xla(1980 1982 to 1992) yla(8.6 8.8 to 9.4) l1("Corrected log(C)")
>                                 saving(C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\mean_right,replace) title(Panel D);
{txt}
{com}. gr7 using       C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\mean_wrong.gph C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\food.gph
>                 C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\diff.gph C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\mean_right.gph, 
>                 saving(C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\mean,replace);
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. ****************The graph above is in the Annex ********************
. 
. lab var v_psd "Var. of log(C) PSID"
{txt}
{com}. lab var v_cex "Var. of log(C) CEX"
{txt}
{com}. 
. *****FIGURE 3 **********
. #delimit;
{txt}delimiter now ;
{com}. twoway (scatter v_psd year, c(l) clp(-) yaxis(1) msymbol(oh)) (scatter v_cex year,c(l) yaxis(2) msymbol(o)) if year>=1980, 
>         ylabel(.18(.02).30, axis(1) nogrid) ylabel(.11(.02).23,axis(2) nogrid) xlabel(1980(2)1992) 
>         ytitle("PSID", axis(1)) ytitle("CEX",axis(2)) xtitle(Year) graphregion(fcolor(white))   
>         saving(C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\var_right_sm,replace);
{res}{txt}(file C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\var_right_sm.gph saved)

{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. ***Income inequality and consumption inequality
. 
. gen svy=v_yp_alt if year==1980
{txt}(12 missing values generated)

{com}. gen svc=v_cex if year==1980
{txt}(12 missing values generated)

{com}. egen tempy=mean(svy)
{txt}
{com}. egen tempc=mean(svc)
{txt}
{com}. gen normv_cex=v_cex+tempy-tempc
{txt}
{com}. drop svy-tempc
{txt}
{com}. 
. lab var v_yp_alt "Var. of log(Y) PSID"
{txt}
{com}. lab var normv_cex "Var. of log(C) CEX, normalized"
{txt}
{com}. gr7 normv_cex v_yp year,        c(ll[-]) s(oi) xla(1980 1982 to 1992) yla(.24(.02).38) l1(" ")
{txt}
{com}. gr7 v_cex v_yp year    ,        c(ll[-]) s(oi) xla(1980 1982 to 1992) yla(.12(.02).38) l1(" ")
{txt}
{com}. gr7 v_yp_alt v_cex year    ,    c(ll[-]) s(oi) xla(1980 1982 to 1992) rla(.13(.02).25) yla(.25(.02).37) rescale
{txt}
{com}. 
. smooth 4253eh,twice v_yp_alt,gen(vyp_sm)
{txt}
{com}. smooth 4253eh,twice v_cex,gen(vcc_sm)
{txt}
{com}. 
. lab var vyp_sm "Var. of log(Y) PSID, smoothed"
{txt}
{com}. lab var vcc_sm "Var. of log(C) CEX, smoothed"
{txt}
{com}. 
. *****FIGURE 1 *****
. #delimit;
{txt}delimiter now ;
{com}. twoway (scatter vyp_sm v_yp_alt year, c(l) yaxis(1) msymbol(i o)) (scatter vcc_sm v_cex year,c(l) clp(-) yaxis(2) msymbol(i sh)) if year>=1980, 
>         ylabel(.26(.02).36, axis(1) nogrid) ylabel(.145(.02).245,axis(2) nogrid) xlabel(1980(2)1992) ytitle("Var(log(Y)) PSID", axis(1)) 
>         ytitle("Var(log(C)) CEX",axis(2)) xtitle(Year) graphregion(fcolor(white));
{res}{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. 
. ***** This produces Figure 4        ********
. ***** It uses MD estimation results ********
. u C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\cy_var_vs_y_var.dta,clear
{txt}
{com}. lab var vp_cy "Using cons. and income data"
{txt}
{com}. lab var vp_y "Using only income data"
{txt}
{com}. #delimit;
{txt}delimiter now ;
{com}. scatter vp_cy vp_y year,c(l l) ylabel(0(.01).04, nogrid) xla(1980(5)1990) ytitle(" ") 
>         graphregion(fcolor(white)) clp(solid dash);
{res}{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. clear
{txt}
{com}. 
. *****This produces Figure 6
. ***** It uses MD estimation results ********
. u C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\trans_var_using_e_y,clear
{txt}
{com}. smooth 4253eh,twice earnings_at,gen(e)
{txt}
{com}. smooth 4253eh,twice income  ,gen(y)
{txt}
{com}. lab var e "Var(log(male earnings))"
{txt}
{com}. lab var y "Var(log(net family income))"
{txt}
{com}. #delimit;
{txt}delimiter now ;
{com}. twoway (scatter e year, c(l) yaxis(1) msymbol(i o)) (scatter y year,c(l) clp(-) yaxis(2) msymbol(i sh)) if year>=1980, 
>         ylabel(.06(.01).10, axis(1) nogrid) ylabel(.03(.01).07,axis(2) nogrid) xlabel(1980(2)1992) ytitle("Male earnings", axis(1)) 
>         ytitle("Net family income",axis(2)) xtitle(Year) graphregion(fcolor(white));
{res}{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. u C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\fig6.dta,clear
{txt}
{com}. lab var zt_cy2 "Baseline sample"
{txt}
{com}. lab var zt_no_college2 "No college education"
{txt}
{com}. lab var zt_college2 "College education"
{txt}
{com}. lab var zt_cy_seo2 "Adding SEO"
{txt}
{com}. lab var zt_total_cons2 "Total exp."
{txt}
{com}. 
. *****This produces Figure 7
. ***** It uses MD estimation results ********
. #delimit;
{txt}delimiter now ;
{com}. scatter zt_cy2 year if year<1990, ylabel(0(.01).04,nogrid) c(l) graphregion(fcolor(white)) saving(temp1,replace);
{res}{txt}(file temp1.gph saved)

{com}. scatter zt_no_college2 zt_college2 year if year<1990, ylabel(0(.01).04,nogrid) c(l l) clp(-) graphregion(fcolor(white)) 
>         ytitle(" ")saving(temp2,replace);
{res}{txt}(file temp2.gph saved)

{com}. scatter zt_cy2 zt_cy_seo2 year if year<1990, ylabel(0(.01).04,nogrid) c(l l) clp(-) graphregion(fcolor(white)) 
>         ytitle(" ")saving(temp3,replace);
{res}{txt}(file temp3.gph saved)

{com}. scatter zt_cy2 zt_total_cons2 year if year<1990, ylabel(0(.01).04,nogrid) c(l l) clp(-) graphregion(fcolor(white)) 
>         ytitle(" ")saving(temp4,replace);
{res}{txt}(file temp4.gph saved)

{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. graph combine temp1.gph temp2.gph temp3.gph temp4.gph, iscale(.70) graphregion(fcolor(white))
{res}{txt}
{com}. 
. *****This produces Figure 5
. ***** It uses MD estimation results ********
. u C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\fit_model
{txt}
{com}. #delimit;
{txt}delimiter now ;
{com}. twoway (scatter act_c pred_c year, c(l l) clp(solid dash) yaxis(1) msymbol(i i)) if year>=1980, 
>         ylabel(.1(.04).22, axis(1) nogrid) xlabel(1980(2)1992) title(Var(Dlog(c))) legend(off)
>         xtitle(Year) graphregion(fcolor(white)) saving(temp1,replace);
{res}{txt}(file temp1.gph saved)

{com}. twoway (scatter act_y pred_y year, c(l l) clp(solid dash) yaxis(1) msymbol(i i)) if year>=1980, 
>         ylabel(.06(.02).12, axis(1) nogrid) xlabel(1980(2)1992) title(Var(Dlog(y))) legend(off)
>         xtitle(Year) graphregion(fcolor(white)) saving(temp2,replace);
{res}{txt}(file temp2.gph saved)

{com}. twoway (scatter act_cy pred_cy year, c(l l) clp(solid dash) yaxis(1) msymbol(i i)) if year>=1980, 
>         ylabel(0(.01).03, axis(1) nogrid) xlabel(1980(2)1992) title(Cov(Dlog(c),Dlog(y))) legend(off)
>         xtitle(Year) graphregion(fcolor(white)) saving(temp3,replace);
{res}{txt}(file temp3.gph saved)

{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. graph combine temp1.gph temp2.gph temp3.gph, graphregion(fcolor(white))
{res}{txt}
{com}. 
. 
. *****This produces Figure 2
. cd C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files
{res}C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files
{txt}
{com}. 
. u data3,clear
{txt}
{com}. 
. keep if seo==0
{txt}(12,455 observations deleted)

{com}. drop if age<30|age>65
{txt}(3,586 observations deleted)

{com}. 
. replace ly=ln(y)
{txt}(17,604 real changes made)

{com}. 
. gen nas_scale=sqrt(ncomp)
{txt}
{com}. replace lc=lc-ln(nas_scale)
{txt}(14,984 real changes made)

{com}. replace ly=ln(y-ftax)-ln(nas_scale)
{txt}(17,604 real changes made, 20 to missing)

{com}. 
. gen lf=ln(food+fout)-ln(nas_scale)
{txt}(2,620 missing values generated)

{com}. collapse (mean) age m_psd=lc m_yp=ly f_p=lf (sd) v_psd=lc v_yp=ly v_fp=lf,by(year coh)
{txt}
{com}. 
. replace v_y=v_y^2
{txt}(58 real changes made)

{com}. replace v_f=v_f^2
{txt}(50 real changes made)

{com}. replace v_f=. if v_f==0
{txt}(0 real changes made)

{com}. replace m_psd=. if m_psd==0
{txt}(0 real changes made)

{com}. replace v_psd=. if v_psd==0
{txt}(0 real changes made)

{com}. 
. replace v_psd=v_psd^2
{txt}(50 real changes made)

{com}. 
. lab var year     "Year"
{txt}
{com}. 
. keep m_* v_* year f_p coh age
{txt}
{com}. sort coh year
{txt}
{com}. save mean_psid_coh,replace
{txt}(note: file mean_psid_coh.dta not found)
file mean_psid_coh.dta saved

{com}. 
. u cexall,clear
{txt}
{com}. 
. gen     coh=1  if yb>=1950 & yb<=1959
{txt}(11,848 missing values generated)

{com}. replace coh=2  if yb>=1940 & yb<=1949
{txt}(5,235 real changes made)

{com}. replace coh=3  if yb>=1930 & yb<=1939
{txt}(3,738 real changes made)

{com}. replace coh=4  if yb>=1920 & yb<=1929
{txt}(2,875 real changes made)

{com}. tab coh,gen(cohd)

        {txt}coh {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,664       23.62       23.62
{txt}          2 {c |}{res}      5,235       33.75       57.37
{txt}          3 {c |}{res}      3,738       24.10       81.47
{txt}          4 {c |}{res}      2,875       18.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     15,512      100.00
{txt}
{com}. drop if coh==.
{txt}(0 observations deleted)

{com}. 
. drop if age <30|age >65
{txt}(0 observations deleted)

{com}. 
. gen nas_scale=sqrt(ncomp)
{txt}
{com}. gen lx=ln(ndur)-ln(nas_scale)
{txt}
{com}. gen ly  =ln(income)
{txt}
{com}. 
. gen lf=ln(food+fout)-ln(nas_scale)
{txt}
{com}. collapse (mean) age m_cex=lx m_yc=ly f_c=lf (sd) v_cex=lx v_yc=ly v_fc=lf,by(year coh)
{txt}
{com}. 
. replace v_yc=v_yc^2
{txt}(52 real changes made)

{com}. replace v_fc=v_fc^2
{txt}(52 real changes made)

{com}. replace m_cex=. if m_cex==0
{txt}(0 real changes made)

{com}. replace v_cex=. if v_cex==0
{txt}(0 real changes made)

{com}. 
. replace v_cex=v_cex^2
{txt}(52 real changes made)

{com}. 
. keep m_* v_* year f_c coh age
{txt}
{com}. sort coh year
{txt}
{com}. save mean_cex_coh,replace
{txt}(note: file mean_cex_coh.dta not found)
file mean_cex_coh.dta saved

{com}. 
. u mean_cex_coh,clear
{txt}
{com}. merge coh year using mean_psid_coh
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          2 {c |}{res}          6       10.34       10.34
{txt}          3 {c |}{res}         52       89.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         58      100.00
{txt}
{com}. drop _merge
{txt}
{com}. save mean_coh,replace
{txt}file mean_coh.dta saved

{com}. 
. erase mean_cex_coh.dta
{txt}
{com}. erase mean_psid_coh.dta
{txt}
{com}. 
. sort coh year
{txt}
{com}. 
. gen vc1=v_cex if coh==1
{txt}(45 missing values generated)

{com}. gen vc2=v_cex if coh==2
{txt}(45 missing values generated)

{com}. gen vc3=v_cex if coh==3
{txt}(45 missing values generated)

{com}. gen vc4=v_cex if coh==4
{txt}(45 missing values generated)

{com}. 
. gen vy1=v_yp if coh==1
{txt}(45 missing values generated)

{com}. gen vy2=v_yp if coh==2
{txt}(43 missing values generated)

{com}. gen vy3=v_yp if coh==3
{txt}(43 missing values generated)

{com}. gen vy4=v_yp if coh==4
{txt}(43 missing values generated)

{com}. 
. smooth 4253eh,twice vc1    ,gen(vc1sm)
{txt}
{com}. smooth 4253eh,twice vc2    ,gen(vc2sm)
{txt}
{com}. smooth 4253eh,twice vc3    ,gen(vc3sm)
{txt}
{com}. smooth 4253eh,twice vc4    ,gen(vc4sm)
{txt}
{com}. 
. smooth 4253eh,twice vy1    ,gen(vy1sm)
{txt}
{com}. smooth 4253eh,twice vy2    ,gen(vy2sm)
{txt}
{com}. smooth 4253eh,twice vy3    ,gen(vy3sm)
{txt}
{com}. smooth 4253eh,twice vy4    ,gen(vy4sm)
{txt}
{com}. 
. lab var age "Age"
{txt}
{com}. lab var vc1sm "Born 1950s"
{txt}
{com}. lab var vc2sm "Born 1940s"
{txt}
{com}. lab var vc3sm "Born 1930s"
{txt}
{com}. lab var vc4sm "Born 1920s"
{txt}
{com}. lab var vy1sm "Born 1950s"
{txt}
{com}. lab var vy2sm "Born 1940s"
{txt}
{com}. lab var vy3sm "Born 1930s"
{txt}
{com}. lab var vy4sm "Born 1920s"
{txt}
{com}. 
. sort coh year
{txt}
{com}. 
. #delimit;
{txt}delimiter now ;
{com}. gr7 vc1sm vc2sm vc3sm vc4sm age if age>=30 & age<=65, xla(30(5)65) yla(.1(.05).25) c(llll) 
>         title("The variance of log consumption over the life-cycle, CEX");
{txt}
{com}. gr7 vy1sm vy2sm vy3sm vy4sm age if age>=30 & age<=65, xla(30(5)65) yla(.15(.05).5) c(llll) 
>         title("The variance of log income over the life-cycle, PSID");
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. #delimit;
{txt}delimiter now ;
{com}. scatter vc1sm vc2sm vc3sm vc4sm age if age>=30 & age<=65, xla(30(5)65) yla(.1(.05).25,nogrid) c(l l l l) graphregion(fcolor(white)) s(oh s x i) ytitle("");
{res}{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\edmun\OneDrive\Documents\Research\BPP_PSID_TimeAgg\Code\InputFiles\BPP_downloaded_files\graphs_variance.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Nov 2019, 16:53:12
{txt}{.-}
{smcl}
{txt}{sf}{ul off}